platformio/platform-ststm32/misc/svd/STM32H755_CM4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>DMA2D</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x52001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA2D</name>
        <description>DMA2D global interrupt</description>
        <value>90</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>DMA2D control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>START</name>
              <description>Start This bit can be used to launch the
              DMA2D according to the parameters loaded in the
              various configuration registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend This bit can be used to suspend
              the current transfer. This bit is set and reset by
              software. It is automatically reset by hardware when
              the START bit is reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort This bit can be used to abort the
              current transfer. This bit is set by software and is
              automatically reset by hardware when the START bit is
              reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIE</name>
              <description>Transfer watermark interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIE</name>
              <description>CLUT access error interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>CLUT transfer complete interrupt enable
              This bit is set and cleared by
              software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIE</name>
              <description>Configuration Error Interrupt Enable
              This bit is set and cleared by
              software.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA2D mode This bit is set and cleared
              by software. It cannot be modified while a transfer
              is ongoing.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>DMA2D Interrupt Status
          Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Transfer error interrupt flag This bit
              is set when an error occurs during a DMA transfer
              (data transfer or automatic CLUT
              loading).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Transfer complete interrupt flag This
              bit is set when a DMA2D transfer operation is
              complete (data transfer only).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIF</name>
              <description>Transfer watermark interrupt flag This
              bit is set when the last pixel of the watermarked
              line has been transferred.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIF</name>
              <description>CLUT access error interrupt flag This
              bit is set when the CPU accesses the CLUT while the
              CLUT is being automatically copied from a system
              memory to the internal DMA2D.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>CLUT transfer complete interrupt flag
              This bit is set when the CLUT copy from a system
              memory area to the internal DMA2D memory is
              complete.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIF</name>
              <description>Configuration error interrupt flag This
              bit is set when the START bit of DMA2D_CR,
              DMA2DFGPFCCR or DMA2D_BGPFCCR is set and a wrong
              configuration has been programmed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>DMA2D interrupt flag clear
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Clear Transfer error interrupt flag
              Programming this bit to 1 clears the TEIF flag in the
              DMA2D_ISR register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>Clear transfer complete interrupt flag
              Programming this bit to 1 clears the TCIF flag in the
              DMA2D_ISR register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTWIF</name>
              <description>Clear transfer watermark interrupt flag
              Programming this bit to 1 clears the TWIF flag in the
              DMA2D_ISR register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAECIF</name>
              <description>Clear CLUT access error interrupt flag
              Programming this bit to 1 clears the CAEIF flag in
              the DMA2D_ISR register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>Clear CLUT transfer complete interrupt
              flag Programming this bit to 1 clears the CTCIF flag
              in the DMA2D_ISR register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCEIF</name>
              <description>Clear configuration error interrupt flag
              Programming this bit to 1 clears the CEIF flag in the
              DMA2D_ISR register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMAR</name>
          <displayName>FGMAR</displayName>
          <description>DMA2D foreground memory address
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Address of the data used
              for the foreground image. This register can only be
              written when data transfers are disabled. Once the
              data transfer has started, this register is
              read-only. The address alignment must match the image
              format selected e.g. a 32-bit per pixel format must
              be 32-bit aligned, a 16-bit per pixel format must be
              16-bit aligned and a 4-bit per pixel format must be
              8-bit aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGOR</name>
          <displayName>FGOR</displayName>
          <description>DMA2D foreground offset
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset Line offset used for the
              foreground expressed in pixel. This value is used to
              generate the address. It is added at the end of each
              line to determine the starting address of the next
              line. These bits can only be written when data
              transfers are disabled. Once a data transfer has
              started, they become read-only. If the image format
              is 4-bit per pixel, the line offset must be
              even.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGMAR</name>
          <displayName>BGMAR</displayName>
          <description>DMA2D background memory address
          register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Address of the data used
              for the background image. This register can only be
              written when data transfers are disabled. Once a data
              transfer has started, this register is read-only. The
              address alignment must match the image format
              selected e.g. a 32-bit per pixel format must be
              32-bit aligned, a 16-bit per pixel format must be
              16-bit aligned and a 4-bit per pixel format must be
              8-bit aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGOR</name>
          <displayName>BGOR</displayName>
          <description>DMA2D background offset
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset Line offset used for the
              background image (expressed in pixel). This value is
              used for the address generation. It is added at the
              end of each line to determine the starting address of
              the next line. These bits can only be written when
              data transfers are disabled. Once data transfer has
              started, they become read-only. If the image format
              is 4-bit per pixel, the line offset must be
              even.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFCCR</name>
          <displayName>FGPFCCR</displayName>
          <description>DMA2D foreground PFC control
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>Color mode These bits defines the color
              format of the foreground image. They can only be
              written when data transfers are disabled. Once the
              transfer has started, they are read-only. others:
              meaningless</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT color mode This bit defines the
              color format of the CLUT. It can only be written when
              the transfer is disabled. Once the CLUT transfer has
              started, this bit is read-only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>Start This bit can be set to start the
              automatic loading of the CLUT. It is automatically
              reset: ** at the end of the transfer ** when the
              transfer is aborted by the user application by
              setting the ABORT bit in DMA2D_CR ** when a transfer
              error occurs ** when the transfer has not started due
              to a configuration error or another transfer
              operation already ongoing (data transfer or automatic
              background CLUT transfer).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size These bits define the size of
              the CLUT used for the foreground image. Once the CLUT
              transfer has started, this field is read-only. The
              number of CLUT entries is equal to CS[7:0] +
              1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode These bits select the alpha
              channel value to be used for the foreground image.
              They can only be written data the transfer are
              disabled. Once the transfer has started, they become
              read-only. other configurations are
              meaningless</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CSS</name>
              <description>Chroma Sub-Sampling These bits define
              the chroma sub-sampling mode for YCbCr color mode.
              Once the transfer has started, these bits are
              read-only. others: meaningless</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha Inverted This bit inverts the
              alpha value. Once the transfer has started, this bit
              is read-only.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <description>Red Blue Swap This bit allows to swap
              the R &amp;amp; B to support BGR or ABGR color
              formats. Once the transfer has started, this bit is
              read-only.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value These bits define a fixed
              alpha channel value which can replace the original
              alpha value or be multiplied by the original alpha
              value according to the alpha mode selected through
              the AM[1:0] bits. These bits can only be written when
              data transfers are disabled. Once a transfer has
              started, they become read-only.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCOLR</name>
          <displayName>FGCOLR</displayName>
          <description>DMA2D foreground color
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Blue Value These bits defines the blue
              value for the A4 or A8 mode of the foreground image.
              They can only be written when data transfers are
              disabled. Once the transfer has started, They are
              read-only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green Value These bits defines the green
              value for the A4 or A8 mode of the foreground image.
              They can only be written when data transfers are
              disabled. Once the transfer has started, They are
              read-only.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>Red Value These bits defines the red
              value for the A4 or A8 mode of the foreground image.
              They can only be written when data transfers are
              disabled. Once the transfer has started, they are
              read-only.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGPFCCR</name>
          <displayName>BGPFCCR</displayName>
          <description>DMA2D background PFC control
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>Color mode These bits define the color
              format of the foreground image. These bits can only
              be written when data transfers are disabled. Once the
              transfer has started, they are read-only. others:
              meaningless</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT Color mode These bits define the
              color format of the CLUT. This register can only be
              written when the transfer is disabled. Once the CLUT
              transfer has started, this bit is
              read-only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>Start This bit is set to start the
              automatic loading of the CLUT. This bit is
              automatically reset: ** at the end of the transfer **
              when the transfer is aborted by the user application
              by setting the ABORT bit in the DMA2D_CR ** when a
              transfer error occurs ** when the transfer has not
              started due to a configuration error or another
              transfer operation already on going (data transfer or
              automatic BackGround CLUT transfer).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size These bits define the size of
              the CLUT used for the BG. Once the CLUT transfer has
              started, this field is read-only. The number of CLUT
              entries is equal to CS[7:0] + 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode These bits define which alpha
              channel value to be used for the background image.
              These bits can only be written when data transfers
              are disabled. Once the transfer has started, they are
              read-only. others: meaningless</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha Inverted This bit inverts the
              alpha value. Once the transfer has started, this bit
              is read-only.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <description>Red Blue Swap This bit allows to swap
              the R &amp;amp; B to support BGR or ABGR color
              formats. Once the transfer has started, this bit is
              read-only.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value These bits define a fixed
              alpha channel value which can replace the original
              alpha value or be multiplied with the original alpha
              value according to the alpha mode selected with bits
              AM[1: 0]. These bits can only be written when data
              transfers are disabled. Once the transfer has
              started, they are read-only.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
